Openfoam-Xeon-host/OpenFOAM-2.3.1/tutorials/multiphase/twoPhaseEulerFoam/laminar/injection/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [ 1 -1 -2 0 0 0 0 ];

internalField       uniform 1e5;

boundaryField
{
    outlet
    {
        //type               fixedValue;
        //value              $internalField;
        type            totalPressure;
        p0              $internalField;
        U               U.air;
        phi             phi.air;
        rho             thermo:rho.air;
        psi             none;
        gamma           1;
        value           $internalField;
    }
    walls
    {
        type               fixedFluxPressure;
        value              $internalField;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
